---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasVectorSettings
source: html/8b867913-8b3b-a871-249a-79be0514240f.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasVectorSettings Method

If true style has vector settings.

## Syntax (C#)
```csharp
public bool HasVectorSettings()
```